{
  "601": "01",
  "602": "02",
  "603": "03",
  "2125605": "$1200",
  "3213335": "PICTURES",
  "15485309": "  3 MONTH MONITORING",
  "23613888": "Everything in the prevoius packages + All you need to fix your one big search engine problem",
  "31255074": "Deliverables",
  "31992483": "Creative Drafts",
  "32271218": "FREE Consult",
  "54036440": "WORK PROCESS",
  "74509799": "  DISCOUNT RETAINER (YOU DO NOT PAY A RETAINER fee FOR 3 MONTHS AFTER MY DELIVERY)",
  "-18db9916": "Click here to get a FREE consultation call!",
  "-4f5367e3": "Fernando Medina",
  "71b8358a": "Experience",
  "293b31": "Work",
  "560f747e": "Services",
  "-64104400": "Contact",
  "-71a5877e": "I'm Fernando Medina.",
  "-3ed49ad5": "The Small Biz",
  "3fc9db45": "Marketer.",
  "-68fc0426": "I’m probably the most straight forward honest marketer you will ever get to work with. If you have a great small business that needs some visibility, I’m your guy.",
  "-67938627": "WORK EXPERIENCE",
  "-33a45de3": "Companies I have worked for in the past.",
  "2c44a42c": "Prudence Organics",
  "-118db3f0": ", Rebrand Coordinator",
  "-12c1b196": "I've helped the new owner to rebrand her beauty brand  in beautiful Duncan. This included multiple logos, mockups, website pages and all branding elements such as colors an fonts.",
  "-5b068daa": "Vancouver Island University",
  "-b5adcd4": ", Program Lead",
  "76f33dcc": "I’ve led a wide variety of programs and their marketing campaigns. Such as the Co-Curricular Record and the university application.",
  "2e6ec71d": "C3 Mainline",
  "66645aa5": ", SEO & Marketing Coordinator",
  "-125759e0": "I currently am leading the marketing efforts this small trades business is seeking. I am optimizing their website for client acquisition on search engines.",
  "-17b479f5": "Philosophy & values",
  "-2a62ff99": "I think small businesses keep Vancouver Island going. The value they provide and their stories are worth telling so I try to grasp these stories and tell them with my skills: marketing, creativity, & hospitality.",
  "-54aca0aa": "More about me",
  "-379627f2": "With skills in over 4 different areas of marketing, I am the perfect person to hire when it comes to a full fledged marketing project. Whatever your needs are, I can pretty much take on any challenge.",
  "5ebe804a": "Web Design",
  "5663920d": "Working with multiple small brands has taught me a lot about how to design a different experience to solve each customers problems, while building simple infrastructure that anyone can edit & use.",
  "-621613ea": "SEO & SMM",
  "1d90f504": "My experience at the university has given me a feel for content that converts and attracts searches to brand websites. Keywords, copywrite, technicalities and the whole package.",
  "-5a1ef143": "Email & Video",
  "-62f77b0b": "I started my marketing journey with email marketing for students. Video in emails is something that really made me understand true storytelling & marketing.",
  "-38f29e83": "Photography",
  "-277b3d60": "Capturing the essence of a brand or a product through a picture is a truly expressive endeavour that I enjoy. Tailoring colors, logos, backgrounds creates a true experience for users.",
  "543680ee": "MY PROJECTS",
  "2d7fb969": "Work that I’ve done for the past 4 years",
  "243ff56e": " VIU's Co-Curricular Record",
  "756826b4": "I worked with the Office of Co-Curricular Engagement and Learning at VIU to lead their entire program, inlcuding website, social media and marketing campaigns. This project lasted for 2 years and was a very fulfilling one.",
  "4795df8f": "VIU's App",
  "-7df2bc30": "I was hired by VIU to launch their mobile app. I was asked to learn the systems & functionalities and come up with all the brand marketing materials.",
  "3c270999": "Rebrand of Prudence",
  "-1944e95f": "I was hired by the new owner of Prudence to create her new brand image and all its marketing materials. This project lasted for a month and was a very challenging one.",
  "-3c3de12c": "VIEW ALL PROJECTS",
  "-6ad79299": "If you are a person who has a small business on Vancouver Island, then I would love to connect with you and hear your story. I’m passionate about the island community and the people that keep it alive so I'd love to help you out however I can. Maybe all you need is a fresh perspective.",
  "4762526f": "Services Packages",
  "-4b1f3bcc": "Here is a collection of my most common services that I use to tell the stories of small businesses around the island. Custom packages are available and I cannot wait to build yours together! Book a call and we'll tell your story to Vancouver Island. (All prices in CAD)",
  "6b45b114": "REBRAND",
  "1403d": "SEO",
  "-794c53e3": "INFLUENCER",
  "77297f71": "CUSTOM",
  "112e12": "$600",
  "5717f497": "This package contains all you need to get started",
  "3e5d92d1": "  ONE REBRANDING ELEMENT (LOGO, WEBSITE, BRANDING ASSETS)",
  "-61b07922": "  MARKETING AUDIT (WEBSITE, Search engine & Social media)",
  "-1ac8acbd": "  INITIAL SEARCH ENGINE OPTIMIZATION",
  "-20028567": "More Info",
  "-19401b35": "Everything in the prevoius packages + All you need to fix your one big branding problem",
  "3ed1d3a7": "  NEW WEBSITE",
  "-e577a01": "  NEW LOGO",
  "79f92c14": "  BRANDING ASSETS",
  "-164feedd": "  REBRAND AD CAMPAIGN (SOCIAL MEDIA)",
  "212d5a7": "$2500",
  "58c5f37b": " Everything in the previous packages + All you need to fully rebrand within a month or less",
  "-29bb42e3": "  PHOTOS & VIDEOS",
  "6db370ac": " REBRAND EMAIL CAMPAIGN",
  "1a997c65": " CONTNUAL SUPPORT (6 MONTHS)",
  "3ce49f8c": "   DEDICATED BI-WEEKLY CONSULTING",
  "61e395e": "  RETAINER DISCOUNT (FUTURE WORK)",
  "580e126c": " WEBSITE SEO CONTENT (COPYWRITE)",
  "-28b3111e": "  MARKETING AUDIT (WEBSITE & SOCIAL MEDIA) & DATA ANALYSIS IF YOU HAVE DATA",
  "-45c8bd54": "  TECHNICAL SEO (CODING & CRAWLING ISSUES)",
  "1778dbb9": " SOCIAL MEDIA CAMPAIGN FOR SEO",
  "-15a69a59": "  Google featured snippet optimization (optimize your site content to appear in google's content snippets)",
  "-cbc11c7": "  BLOG SETUP FOR SEO",
  "-79e0480f": "  BACKLINK CAMPAIGN REACHOUT (YOUR WEBSITE LINKS IN SOMEONE ELSE'S WEBSITE)",
  "-7c2ffa9a": "  6 Month monitoring",
  "45a392ac": "  SEO REPORT (FOR YOU OR YOUR OWN TEAM TO CONTINUE IMPROVING YOUR SEO)",
  "-a79b4a6": "  ONE social media campaign in one of your channels",
  "2599fd4b": "  STANDARIZATION OF ALL YOUR SOCIAL MEDIA CHANNELS",
  "-53dcb73f": "Everything in the prevoius packages + All you need to fix your one big social media problem",
  "-b349005": "  3 SOCIAL MEDIA CAMPAIGNS FOR YOUR CHANNELS",
  "-1a4f37": "  ONE EMAIL CAMPAIGN OR SETUP OF AN EMAIL NEWSLETTER",
  "5360ff4c": "  ONE ADVERTISING CAMPAIGN FOR $300",
  "-34a54960": "  FOCUS ON ANOTHER SPECIFIC MEDIA PROBLEM OF YOURS",
  "12dff65a": "Everything in the prevoius packages + All you need to fix your  social media problems",
  "-6049d286": "  4 social media campaigns for your channels",
  "-12dbfabf": "  3 email campaigns + EMAIL NEWSLETTER ONBOARDING AND UPSELL CAMPAIGN",
  "7efe149c": "  3 ADVERTISING CAMPAIGNS WORTH $400",
  "-3ab9aaba": "FREE 30 MIN CALL!",
  "3e712925": "Let's get in touch and discover what will make that difference in your brand to achieve your sales goals. A custom package offers you the ability to mix and match packages from any of the other tabs for a similar price. Feel free to book a FREE 30 minute call with me to discuss your problem and how I can help you solve it.",
  "34b2ff4": "BOOK A CALL",
  "131e0d12": "My LinkedIn",
  "-3150ddc7": "Stay up to date with the projects I am working on. Check out my work on",
  "4f4e023d": "Linkedin. Likes and comments are appreciated.",
  "37f96806": "Follow me on LinkedIn",
  "2c7dfe09": "This is what people say about me",
  "-14b7c127": "Here are a few testimonies from people who I have worked with over the past four years in my marketing career.",
  "-acd2b98": "‘’Fernando is one of the best marketers I have worked with. He is very capable of taking up complex projects and delivers impeccable results and I don't have to manage him.’’",
  "-63b37199": "Connie Gonyea",
  "45338bc5": "Owner, Prudence Organics",
  "45a98aa6": "‘’I think Fernando has an incredible gift. It has been an absolute pleasure to work with a person of this caliber for such a long period of time.’’",
  "-5670a8d1": "Omar Karim",
  "-7c4cca5f": "CEO, Global Emerging Leadersihp Conference",
  "-4aba8daf": "‘’All I can say is that Fernando is a phenomenal marketing guy. The extent of his skill is astounding. I love the focus, passion and attention to detail in his efforts with our SEO.’’",
  "-5baeec77": "Joshua Gonyea",
  "1b07295b": "CEO, C3 Mainline Inspections",
  "326f3a89": "Let’s talk business",
  "49bf1e23": "Now that you know about me, let me know if you are interested to work with me.",
  "24eeab": "Name",
  "-2b7010d0": "Email Address",
  "-63dc6819": "Message",
  "5a0ea5a1": "Thank you! Your submission has been received!",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "2268ff": "Home",
  "3c2336d": "About",
  "50c5b64f": "Process",
  "543fb668": "No Copyright 2023 • Fernando Medina. ",
  "f43ec48": "fermedmor@gmail.com",
  "-7eed2f20": "Click here to get a FREE consultation call to discuss your marketing needs and work together OR give you some pointers!",
  "2b4cf6bd": "Co-Curricular Involvement App.",
  "4fceb997": "Vancouver Island University required an application for engaging students",
  "7877dfeb": "Client",
  "26f496": "Role",
  "2063ce": "Date",
  "5f60ffa9": "Marketing Campaigns",
  "1abcb7cf": "2021-2023",
  "-3e62dfc7": "The launch of the application involved the creation of email campaigns, infographics, videos, training booklets, among many others. Explore below to get an idea of my work!",
  "73c56c7b": "WEBSITE",
  "3f0537c": "EMAIL",
  "34a69a8b": "GRAPHICS",
  "4de1c5b": "VIDEO",
  "4246d4e0": "Click here to get a FREE consultation call to discuss your marketing needs and work together or give you some pointers!",
  "-23cc2716": "Store for",
  "6bdf1b70": "Services.",
  "7746860d": "Check out all my different services and feel free to book a FREE call to mix and match any of the services you see below. They include Rebranding, Search Engine Optimization, Influencer (Social Media) and Custom packages. Let's use my skills to solve your problem.",
  "-42fd2db2": "Rebranding",
  "4fe11c07": "Rebranding packages include",
  "-1f6463c3": "Influencer",
  "-25afbb6e": "Let's build a package that works for your specific needs",
  "78fb7791": "Custom",
  "-29ad0cc5": "Fernando.",
  "-380eec4f": "Process ",
  "f095": "",
  "-4250866b": "Consultation Call",
  "-35c5e617": "Free 30 min Virtual Meeting",
  "677cebfb": "First I like to meet my clients and hear their problems to see if we would be a good fit. Sometimes they only need some guidance and direction to other resources.",
  "f14e": "",
  "-cbc1847": "Discovery & Alignment",
  "241b8a63": "1hr call",
  "-424cd67b": "Then, if we're a good fit and I can help them solve their problem we outline together what they want to get out of the project, the timeline , deliverables and final pricing.",
  "f1f9": "",
  "2572f1b": "Branding",
  "-2243800f": "30 min ",
  "474219e6": "Virtual Meeting",
  "4623b016": "Afterwards, I present the client with branding elements such as ideal customer, user journey and look & feel of the brand. The client gives feedback and I use this as my foundation for the deliverables.",
  "e4e3": "",
  "59bbc20f": "30 min",
  "329cfa19": "If the customer needs rebranding assets such as a logo for example, I present them with 3 different boards to see which one fits their brand best and then I create all the final products based on that board.",
  "f802": "",
  "1977aafe": "Final Deliverables",
  "31f6a95": "I present the client with the final deliverables such as videos, campaigns, logos, fonts, ads, website, pictures, emails and ask for feedback on their experience. ",
  "f530": "",
  "4fea6cfa": "Training",
  "-4f1dea05": "30-6O min",
  "6c8a60f3": "IF DESIRED I provide the client with any training required to succeed with the marketing I've helped with. For example showing them how to edit the website without hiring another marketer",
  "1590d36c": "Testimonies.",
  "11da98e6": "I currently am the lead marketer on the rebranding that this beauty brand is undergoing in beautiful Duncan.",
  "-5e1280a0": "Lady Mujer's Website",
  "12c75e8e": "I worked with the ceramic artist at Lady Mujer Ceramics to create from scratch her entire brand, inluding website, brand identity, SEO optimization and social media management. This project lasted for 2 months and I still get to work on it and see its growth.",
  "-5b3a6b5b": "Here is a collection of my most common services that I use to tell the stories of small businesses around the island. Custom packages are available and I cannot wait to build yours together! Book a call and we'll tell your story to Vancouver Island.",
  "13f91915": "OPTIMIZER",
  "67083c20": "See all testimonials",
  "586d8634": "‘’Fernando is one of the best designers I have worked with in my entire life. He is a designer who is very capable of taking up complex projects and delivers impeccable design.’’",
  "-248866f": "‘’I think Robin has an incredible gift. It has been an absolute pleasure to work with a designer of this caliber.’’",
  "-6cfec30f": "‘’All I can say that, Robin is a phenomenal designer. The wavelength at which he thinks is astoundaing. I love the focus, passion and attention to detial in the design.’’",
  "-43721e9a": "All my work",
  "421c16d4": "Projects.",
  "5bd137e5": "Check out all the projects I've worked for in the past four years. You can see what I've created for them such as graphics, videos, emails, photoshoots and other multiple assets.",
  "-1d8b8fa2": "BECOME THE NEXT SUCCESS",
  "-51ee52e4": "Co-Curricular Record",
  "-4f8fda4b": "Vancouver Island University required marketing and leadership for their Co-Curricular Record programs",
  "5c4fe174": "Prudence Organics ",
  "200d": "‍",
  "-2f5673d0": "Prudence required a whole rebrand as they had changed owners. The whole new identity of the company targetted younger generations who shop online.",
  "-10830864": "Feb 2023",
  "23bdab": "LOGO",
  "48086f0": "OTHER"
}